In [1]:
import pandas as pd
import numpy as np

x = [1, 2, 3, 4, 5, 6, 7]
x = pd.Series(x)

In [2]:
x[1:4]

1    2
2    3
3    4
dtype: int64

In [3]:
x[x>3]

3    4
4    5
5    6
6    7
dtype: int64

In [4]:
x * 10

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [5]:
x.index

RangeIndex(start=0, stop=7, step=1)

In [6]:
x.values

array([1, 2, 3, 4, 5, 6, 7], dtype=int64)

In [7]:
x = [1, 2, 3, 4, 5, 6, 7]
x = pd.Series(x, index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])

In [8]:
x['b']

2

In [9]:
x[0]

1

In [10]:
x.b

2

In [11]:
x[['a','c']]

a    1
c    3
dtype: int64

In [12]:
x = {"수학":90, "영어":80, "과학":95, "미술":80}
x = pd.Series(x)
x

수학    90
영어    80
과학    95
미술    80
dtype: int64

In [13]:
x['수학']

90

In [14]:
x[0]

90

In [15]:
x['영어':]

영어    80
과학    95
미술    80
dtype: int64

In [16]:
x = {"수학":90, "영어":80, "과학":95, "미술":80}
pd.Series(x, index=["과학", "미술"])

과학    95
미술    80
dtype: int64

In [17]:
score = [50, 60, 65, 70, 90, 60, 80, 90]
index_1 = ['홍길동', '홍길동', '홍길동', '홍길동', '이몽룡', '이몽룡', '이몽룡', '이몽룡']
index_2 = ['수학', '영어', '과학', '미술', '수학', '영어', '과학', '미술']

In [18]:
pd.Series(score, index=[index_1, index_2])

홍길동  수학    50
     영어    60
     과학    65
     미술    70
이몽룡  수학    90
     영어    60
     과학    80
     미술    90
dtype: int64

In [19]:
data = [1, None, 2, None, 3, 4, None]
data = pd.Series(data)
data.sum()

10.0

In [20]:
data.isnull().sum()

3

In [21]:
data.notnull().sum()

4

In [22]:
data.dropna()

0    1.0
2    2.0
4    3.0
5    4.0
dtype: float64

In [23]:
data.fillna(0)

0    1.0
1    0.0
2    2.0
3    0.0
4    3.0
5    4.0
6    0.0
dtype: float64

In [24]:
x = pd.Series([1, 2, 3])
y = pd.Series([4, 5, 6])
z = pd.Series([7, 8, 9])
pd.concat([x, y, z])

0    1
1    2
2    3
0    4
1    5
2    6
0    7
1    8
2    9
dtype: int64

In [25]:
pd.concat([x, y, x], ignore_index=True)

0    1
1    2
2    3
3    4
4    5
5    6
6    1
7    2
8    3
dtype: int64

In [26]:
pd.concat([x, y, z], ignore_index=True, axis=1)

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [27]:
x = [1, 2, 3, 4, 5, 6, 7]
x = pd.Series(x)
x.count()

7

In [28]:
x.describe()

count    7.000000
mean     4.000000
std      2.160247
min      1.000000
25%      2.500000
50%      4.000000
75%      5.500000
max      7.000000
dtype: float64

In [29]:
x.head(2)

0    1
1    2
dtype: int64

### 실습01

In [30]:
x = [np.nan, 1, 2, 3, 4, 5]
y = pd.Series([x[np.random.randint(0, 6)] for i in range(20)])
print(y)

0     4.0
1     NaN
2     1.0
3     NaN
4     4.0
5     2.0
6     2.0
7     4.0
8     5.0
9     5.0
10    5.0
11    2.0
12    2.0
13    2.0
14    1.0
15    3.0
16    1.0
17    2.0
18    3.0
19    1.0
dtype: float64

In [31]:
# 1. 결측값 개수 구하기
y.isnull().sum()

2

In [32]:
# 2. 결측값 제거한 Series 만들기
y.dropna()

0     4.0
2     1.0
4     4.0
5     2.0
6     2.0
7     4.0
8     5.0
9     5.0
10    5.0
11    2.0
12    2.0
13    2.0
14    1.0
15    3.0
16    1.0
17    2.0
18    3.0
19    1.0
dtype: float64

In [33]:
# 3. 결측값에 y의 평균을 넣은 Series 만들기
y.fillna(y.mean())

0     4.000000
1     2.722222
2     1.000000
3     2.722222
4     4.000000
5     2.000000
6     2.000000
7     4.000000
8     5.000000
9     5.000000
10    5.000000
11    2.000000
12    2.000000
13    2.000000
14    1.000000
15    3.000000
16    1.000000
17    2.000000
18    3.000000
19    1.000000
dtype: float64

### 실습 끝

In [34]:
sales_data = {
    '연도':[2015,2016,2017,2018,2019,2020],
    '판매량':[103,70,130,160,190,230],
    '매출':[500000,300000,400000,550000,700000,680000],
    '순이익':[370000,190000,300000,480000,60000,590000]
}

In [35]:
sales_data = pd.DataFrame(sales_data)
sales_data

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000   60000
5  2020  230  680000  590000

In [36]:
sales_data['판매량']

0    103
1     70
2    130
3    160
4    190
5    230
Name: 판매량, dtype: int64

In [37]:
sales_data.iloc[1]

연도       2016
판매량        70
매출     300000
순이익    190000
Name: 1, dtype: int64

In [38]:
sales_data = {
    '연도':[2015,2016,2017,2018,2019,2020],
    '판매량':[103,70,130,160,190,230],
    '매출':[500000,300000,400000,550000,700000,680000],
    '순이익':[370000,190000,300000,480000,60000,590000]
}

sales_data = pd.DataFrame(sales_data, columns=['판매량','매출','순이익'], index=[sales_data['연도']])

In [39]:
sales_data

      판매량      매출     순이익
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018  160  550000  480000
2019  190  700000   60000
2020  230  680000  590000

In [40]:
%%writefile sales_data.csv
연도,판매량,매출,순익
2015,103,500000,370000
2016,70,300000,190000
2017,130,400000,300000
2018,60,550000,480000
2019,190,700000,600000
2020,230,680000,590000

Overwriting sales_data.csv

In [41]:
# 파일읽기
sales_data = pd.read_csv('sales_data.csv', index_col='연도', header=0, sep=',')

In [42]:
sales_data

      판매량      매출      순익
연도
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018   60  550000  480000
2019  190  700000  600000
2020  230  680000  590000

In [43]:
sales_data.to_csv('sales_data_2.csv', encoding='utf-8-sig')

In [44]:
sales_data['순이익율'] = (sales_data['순익'] / sales_data['매출']) * 100
sales_data

      판매량      매출      순익       순이익율
연도
2015  103  500000  370000  74.000000
2016   70  300000  190000  63.333333
2017  130  400000  300000  75.000000
2018   60  550000  480000  87.272727
2019  190  700000  600000  85.714286
2020  230  680000  590000  86.764706

In [45]:
def check(n):
    if n > 80:
        return '높음'
    else:
        return '낮음'

sales_data['순이익율_비교'] = sales_data['순이익율'].apply(check)
sales_data['순이익율_비교2'] = sales_data['순이익율'].apply(lambda n : '높음' if n > 80 else '낮음')
sales_data

      판매량      매출      순익       순이익율 순이익율_비교 순이익율_비교2
연도
2015  103  500000  370000  74.000000      낮음       낮음
2016   70  300000  190000  63.333333      낮음       낮음
2017  130  400000  300000  75.000000      낮음       낮음
2018   60  550000  480000  87.272727      높음       높음
2019  190  700000  600000  85.714286      높음       높음
2020  230  680000  590000  86.764706      높음       높음

In [46]:
def check(n):
    if n > 80:
        return '높음'
    else:
        return '낮음'
    
check_lambda = lambda n: '높음' if n > 80 else '낮음'
check_lambda(40)

'낮음'

In [47]:
sales_data[sales_data['매출'] > 300000]

      판매량      매출      순익       순이익율 순이익율_비교 순이익율_비교2
연도
2015  103  500000  370000  74.000000      낮음       낮음
2017  130  400000  300000  75.000000      낮음       낮음
2018   60  550000  480000  87.272727      높음       높음
2019  190  700000  600000  85.714286      높음       높음
2020  230  680000  590000  86.764706      높음       높음

In [48]:
sales_data

      판매량      매출      순익       순이익율 순이익율_비교 순이익율_비교2
연도
2015  103  500000  370000  74.000000      낮음       낮음
2016   70  300000  190000  63.333333      낮음       낮음
2017  130  400000  300000  75.000000      낮음       낮음
2018   60  550000  480000  87.272727      높음       높음
2019  190  700000  600000  85.714286      높음       높음
2020  230  680000  590000  86.764706      높음       높음

In [49]:
sales_data['테스트1'] = np.where(sales_data['판매량']> 200, 0, sales_data['판매량'])

In [50]:
sales_data

      판매량      매출      순익       순이익율 순이익율_비교 순이익율_비교2  테스트1
연도
2015  103  500000  370000  74.000000      낮음       낮음   103
2016   70  300000  190000  63.333333      낮음       낮음    70
2017  130  400000  300000  75.000000      낮음       낮음   130
2018   60  550000  480000  87.272727      높음       높음    60
2019  190  700000  600000  85.714286      높음       높음   190
2020  230  680000  590000  86.764706      높음       높음     0

In [51]:
sales_data['테스트2'] = sales_data[sales_data['판매량'] < 100]['판매량'] + 50

In [52]:
sales_data

      판매량      매출      순익       순이익율 순이익율_비교 순이익율_비교2  테스트1   테스트2
연도
2015  103  500000  370000  74.000000      낮음       낮음   103    NaN
2016   70  300000  190000  63.333333      낮음       낮음    70  120.0
2017  130  400000  300000  75.000000      낮음       낮음   130    NaN
2018   60  550000  480000  87.272727      높음       높음    60  110.0
2019  190  700000  600000  85.714286      높음       높음   190    NaN
2020  230  680000  590000  86.764706      높음       높음     0    NaN

In [53]:
sales_data['테스트2'] = sales_data[sales_data['판매량'] >= 100]['판매량'] - 50

In [54]:
sales_data

      판매량      매출      순익       순이익율 순이익율_비교 순이익율_비교2  테스트1   테스트2
연도
2015  103  500000  370000  74.000000      낮음       낮음   103   53.0
2016   70  300000  190000  63.333333      낮음       낮음    70    NaN
2017  130  400000  300000  75.000000      낮음       낮음   130   80.0
2018   60  550000  480000  87.272727      높음       높음    60    NaN
2019  190  700000  600000  85.714286      높음       높음   190  140.0
2020  230  680000  590000  86.764706      높음       높음     0  180.0

In [55]:
sales_data.loc[6] = [360, 720000, 650000, 360, '높음', '높음', 0 , 180.0]

In [56]:
sales_data

      판매량      매출      순익        순이익율 순이익율_비교 순이익율_비교2  테스트1   테스트2
연도
2015  103  500000  370000   74.000000      낮음       낮음   103   53.0
2016   70  300000  190000   63.333333      낮음       낮음    70    NaN
2017  130  400000  300000   75.000000      낮음       낮음   130   80.0
2018   60  550000  480000   87.272727      높음       높음    60    NaN
2019  190  700000  600000   85.714286      높음       높음   190  140.0
2020  230  680000  590000   86.764706      높음       높음     0  180.0
6     360  720000  650000  360.000000      높음       높음     0  180.0

In [57]:
sales_data = pd.read_csv('sales_data.csv', index_col='연도', header=0, sep=',')
sales_data

      판매량      매출      순익
연도
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018   60  550000  480000
2019  190  700000  600000
2020  230  680000  590000

In [58]:
sales_data.loc[5] = [230, 30, 30]

In [59]:
sales_data.loc[6] = sales_data.loc[5] + 100

In [60]:
sales_data['삭제테스트1'] = '삭제테스트1'
sales_data['삭제테스트2'] = '삭제테스트2'
sales_data['삭제테스트3'] = '삭제테스트3'

In [61]:
sales_data

      판매량      매출      순익  삭제테스트1  삭제테스트2  삭제테스트3
연도
2015  103  500000  370000  삭제테스트1  삭제테스트2  삭제테스트3
2016   70  300000  190000  삭제테스트1  삭제테스트2  삭제테스트3
2017  130  400000  300000  삭제테스트1  삭제테스트2  삭제테스트3
2018   60  550000  480000  삭제테스트1  삭제테스트2  삭제테스트3
2019  190  700000  600000  삭제테스트1  삭제테스트2  삭제테스트3
2020  230  680000  590000  삭제테스트1  삭제테스트2  삭제테스트3
5     230      30      30  삭제테스트1  삭제테스트2  삭제테스트3
6     330     130     130  삭제테스트1  삭제테스트2  삭제테스트3

In [62]:
del sales_data['삭제테스트1']

In [63]:
sales_data

      판매량      매출      순익  삭제테스트2  삭제테스트3
연도
2015  103  500000  370000  삭제테스트2  삭제테스트3
2016   70  300000  190000  삭제테스트2  삭제테스트3
2017  130  400000  300000  삭제테스트2  삭제테스트3
2018   60  550000  480000  삭제테스트2  삭제테스트3
2019  190  700000  600000  삭제테스트2  삭제테스트3
2020  230  680000  590000  삭제테스트2  삭제테스트3
5     230      30      30  삭제테스트2  삭제테스트3
6     330     130     130  삭제테스트2  삭제테스트3

In [64]:
sales_data.drop(['판매량'], axis='columns', inplace=True)

In [65]:
sales_data

          매출      순익  삭제테스트2  삭제테스트3
연도
2015  500000  370000  삭제테스트2  삭제테스트3
2016  300000  190000  삭제테스트2  삭제테스트3
2017  400000  300000  삭제테스트2  삭제테스트3
2018  550000  480000  삭제테스트2  삭제테스트3
2019  700000  600000  삭제테스트2  삭제테스트3
2020  680000  590000  삭제테스트2  삭제테스트3
5         30      30  삭제테스트2  삭제테스트3
6        130     130  삭제테스트2  삭제테스트3

In [66]:
sales_data.drop(sales_data.columns[[0, 2]], axis='columns', inplace=True)

In [67]:
sales_data

          순익  삭제테스트3
연도
2015  370000  삭제테스트3
2016  190000  삭제테스트3
2017  300000  삭제테스트3
2018  480000  삭제테스트3
2019  600000  삭제테스트3
2020  590000  삭제테스트3
5         30  삭제테스트3
6        130  삭제테스트3

In [68]:
df = pd.DataFrame(np.random.randint(1, 100, size=(8, 2)),
    index=[['A창고','A창고','A창고','A창고','B창고','B창고','B창고','B창고'],
    ['사과','배','바나나','사과','사과','배','바나나','배']],
    columns=['판매','재고'])
df.index.names = ['창고명','상품명']

In [69]:
df

         판매  재고
창고명 상품명
A창고 사과   25  64
    배    11  43
    바나나  70  49
    사과   53  66
B창고 사과   72  92
    배    46   8
    바나나  49   6
    배    88  57

In [70]:
df.groupby('창고명').sum()

      판매   재고
창고명
A창고  159  222
B창고  255  163

In [71]:
df.groupby('상품명').sum()

      판매   재고
상품명
바나나  119   55
배    145  108
사과   150  222

In [72]:
df.groupby(['창고명','상품명']).mean()

           판매    재고
창고명 상품명
A창고 바나나  70.0  49.0
    배    11.0  43.0
    사과   39.0  65.0
B창고 바나나  49.0   6.0
    배    67.0  32.5
    사과   72.0  92.0

In [73]:
df

         판매  재고
창고명 상품명
A창고 사과   25  64
    배    11  43
    바나나  70  49
    사과   53  66
B창고 사과   72  92
    배    46   8
    바나나  49   6
    배    88  57

In [74]:
df.sort_values(by="판매", ascending=False)

         판매  재고
창고명 상품명
B창고 배    88  57
    사과   72  92
A창고 바나나  70  49
    사과   53  66
B창고 바나나  49   6
    배    46   8
A창고 사과   25  64
    배    11  43

In [75]:
df.sort_values(by=["판매","재고"], ascending=[False,True])

         판매  재고
창고명 상품명
B창고 배    88  57
    사과   72  92
A창고 바나나  70  49
    사과   53  66
B창고 바나나  49   6
    배    46   8
A창고 사과   25  64
    배    11  43

### 실습02

In [76]:
# 데이터프레임 만들기
df = pd.DataFrame(np.random.randint(1, 100, size=(15, 3)),
    index=[['1학년','1학년','1학년','1학년','1학년','2학년','2학년','2학년','2학년','2학년','3학년','3학년','3학년','3학년','3학년'],
          ['1반','2반','3반','4반','5반','1반','2반','3반','4반','5반','1반','2반','3반','4반','5반']],
    columns=['국어','영어','과학'])

In [77]:
df

        국어  영어  과학
1학년 1반  54  54  12
    2반   6  63  43
    3반  82  98  73
    4반  73  37  36
    5반  58  83  99
2학년 1반  11  19  59
    2반  30  66  67
    3반  76   1  31
    4반  79  76  99
    5반  67  66  16
3학년 1반  80  57   4
    2반  96  89   2
    3반  39   5  63
    4반  19  89  97
    5반   5  73  10

In [78]:
# 반별합계와 평균 추가하기
df['합계'] = df['국어'] + df['영어'] + df['과학']
df['평균'] = df['합계'] / 3
df

        국어  영어  과학   합계         평균
1학년 1반  54  54  12  120  40.000000
    2반   6  63  43  112  37.333333
    3반  82  98  73  253  84.333333
    4반  73  37  36  146  48.666667
    5반  58  83  99  240  80.000000
2학년 1반  11  19  59   89  29.666667
    2반  30  66  67  163  54.333333
    3반  76   1  31  108  36.000000
    4반  79  76  99  254  84.666667
    5반  67  66  16  149  49.666667
3학년 1반  80  57   4  141  47.000000
    2반  96  89   2  187  62.333333
    3반  39   5  63  107  35.666667
    4반  19  89  97  205  68.333333
    5반   5  73  10   88  29.333333

In [79]:
# 인덱스명을 추가후 학년별 합계 구하기
df.index.names = ['학년', '반']
df.groupby(['학년']).sum()

      국어   영어   과학   합계          평균
학년
1학년  273  335  263  871  290.333333
2학년  263  228  272  763  254.333333
3학년  239  313  176  728  242.666667

### 실습03

In [80]:
data = pd.read_csv('titanic_train.csv')
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [81]:
# 1. 결측치 처리하기(age - 평균값, Cabin - N, Embarked - N)
data["Age"].fillna(data["Age"].mean(), inplace=True)
data["Cabin"].fillna("N", inplace=True)
data["Embarked"].fillna("N", inplace=True)
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,N,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,N,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,N,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,N,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,N,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,N,Q

In [84]:
# 2. 성별 생존자 합 구하기